{"format": "graph-model", "generatedBy": "2.4.0", "convertedBy": "TensorFlow.js Converter v2.8.3", "signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "8"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/zeros", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/concat/values_1/0/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/concat/values_1/1/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/concat_1/values_1/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/concat_3/values_1/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/concat_3/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_3/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_3/stack_1/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/sub_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_3/stack_1/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_3/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/sub_3/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/concat_4/values_1/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/concat_4/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/floordiv/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/sub_4/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/mul_4/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/concat_5/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_4/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_4/stack_1/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/lambda/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "2"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/decoder/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "20480"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/decoder/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20480"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/decoder/reshape/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/reshape/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/reshape/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/reshape/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/reshape/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/reshape/Reshape/shape/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d_2/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d_2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d_2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d_2/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/zero_padding2d/Pad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/lambda/Sqrt", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/lambda/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/irfft/fft_length", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/inverse_stft_window_fn/truediv", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/sub/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_4/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "8"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/decoder/dense/Relu", "op": "_FusedMatMul", "input": ["input_1", "StatefulPartitionedCall/synth/decoder/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/synth/decoder/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/synth/decoder/reshape/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/synth/decoder/dense/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/reshape/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/synth/decoder/reshape/Shape", "StatefulPartitionedCall/synth/decoder/reshape/strided_slice/stack", "StatefulPartitionedCall/synth/decoder/reshape/strided_slice/stack_1", "StatefulPartitionedCall/synth/decoder/reshape/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/synth/decoder/reshape/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/synth/decoder/reshape/strided_slice", "StatefulPartitionedCall/synth/decoder/reshape/Reshape/shape/1", "StatefulPartitionedCall/synth/decoder/reshape/Reshape/shape/2", "StatefulPartitionedCall/synth/decoder/reshape/Reshape/shape/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/reshape/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/synth/decoder/dense/Relu", "StatefulPartitionedCall/synth/decoder/reshape/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/synth/decoder/reshape/Reshape"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose/Shape", "StatefulPartitionedCall/synth/decoder/conv2d_transpose/strided_slice/stack", "StatefulPartitionedCall/synth/decoder/conv2d_transpose/strided_slice/stack_1", "StatefulPartitionedCall/synth/decoder/conv2d_transpose/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose/stack", "op": "Pack", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose/strided_slice", "StatefulPartitionedCall/synth/decoder/conv2d_transpose/stack/1", "StatefulPartitionedCall/synth/decoder/conv2d_transpose/stack/2", "StatefulPartitionedCall/synth/decoder/conv2d_transpose/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose/stack", "StatefulPartitionedCall/synth/decoder/conv2d_transpose/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/synth/decoder/reshape/Reshape"], "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose/conv2d_transpose", "StatefulPartitionedCall/synth/decoder/conv2d_transpose/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/decoder/re_lu_4/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/synth/decoder/re_lu_4/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/synth/decoder/up_sampling2d/Shape", "StatefulPartitionedCall/synth/decoder/up_sampling2d/strided_slice/stack", "StatefulPartitionedCall/synth/decoder/up_sampling2d/strided_slice/stack_1", "StatefulPartitionedCall/synth/decoder/up_sampling2d/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d/mul", "op": "Mul", "input": ["StatefulPartitionedCall/synth/decoder/up_sampling2d/strided_slice", "StatefulPartitionedCall/synth/decoder/up_sampling2d/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/synth/decoder/re_lu_4/Relu", "StatefulPartitionedCall/synth/decoder/up_sampling2d/mul"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/synth/decoder/up_sampling2d/resize/ResizeNearestNeighbor"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/Shape", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/strided_slice/stack", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/strided_slice/stack_1", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/stack", "op": "Pack", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/strided_slice", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/stack/1", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/stack/2", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/stack/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/stack", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/synth/decoder/up_sampling2d/resize/ResizeNearestNeighbor"], "attr": {"use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/conv2d_transpose", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/synth/decoder/re_lu_5/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/synth/decoder/re_lu_5/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/synth/decoder/up_sampling2d_1/Shape", "StatefulPartitionedCall/synth/decoder/up_sampling2d_1/strided_slice/stack", "StatefulPartitionedCall/synth/decoder/up_sampling2d_1/strided_slice/stack_1", "StatefulPartitionedCall/synth/decoder/up_sampling2d_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/synth/decoder/up_sampling2d_1/strided_slice", "StatefulPartitionedCall/synth/decoder/up_sampling2d_1/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d_1/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/synth/decoder/re_lu_5/Relu", "StatefulPartitionedCall/synth/decoder/up_sampling2d_1/mul"], "attr": {"align_corners": {"b": false}, "T": {"type": "DT_FLOAT"}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/synth/decoder/up_sampling2d_1/resize/ResizeNearestNeighbor"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/Shape", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/strided_slice/stack", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/strided_slice/stack_1", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/stack", "op": "Pack", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/strided_slice", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/stack/1", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/stack/2", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/stack/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/stack", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/synth/decoder/up_sampling2d_1/resize/ResizeNearestNeighbor"], "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/conv2d_transpose", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/decoder/re_lu_6/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/synth/decoder/re_lu_6/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/synth/decoder/up_sampling2d_2/Shape", "StatefulPartitionedCall/synth/decoder/up_sampling2d_2/strided_slice/stack", "StatefulPartitionedCall/synth/decoder/up_sampling2d_2/strided_slice/stack_1", "StatefulPartitionedCall/synth/decoder/up_sampling2d_2/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d_2/mul", "op": "Mul", "input": ["StatefulPartitionedCall/synth/decoder/up_sampling2d_2/strided_slice", "StatefulPartitionedCall/synth/decoder/up_sampling2d_2/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/up_sampling2d_2/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/synth/decoder/re_lu_6/Relu", "StatefulPartitionedCall/synth/decoder/up_sampling2d_2/mul"], "attr": {"half_pixel_centers": {"b": true}, "align_corners": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/decoder/zero_padding2d/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/synth/decoder/up_sampling2d_2/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/synth/decoder/zero_padding2d/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/synth/decoder/zero_padding2d/Pad"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/Shape", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/strided_slice/stack", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/strided_slice/stack_1", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/stack", "op": "Pack", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/strided_slice", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/stack/1", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/stack/2", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/stack/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/stack", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/synth/decoder/zero_padding2d/Pad"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/conv2d_transpose", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/synth/decoder/re_lu_7/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/synth/decoder/re_lu_7/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/Shape", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/strided_slice/stack", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/strided_slice/stack_1", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/stack", "op": "Pack", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/strided_slice", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/stack/1", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/stack/2", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/stack", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/synth/decoder/re_lu_7/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/conv2d_transpose", "StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/synth/lambda/mul", "op": "Mul", "input": ["StatefulPartitionedCall/synth/decoder/conv2d_transpose_4/BiasAdd", "StatefulPartitionedCall/synth/lambda/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/lambda/add", "op": "AddV2", "input": ["StatefulPartitionedCall/synth/lambda/mul", "StatefulPartitionedCall/synth/lambda/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/lambda/split", "op": "Split", "input": ["StatefulPartitionedCall/synth/lambda/split/split_dim", "StatefulPartitionedCall/synth/lambda/add"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "2"}}}, {"name": "StatefulPartitionedCall/synth/lambda/Cos", "op": "Cos", "input": ["StatefulPartitionedCall/synth/lambda/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/lambda/Sin", "op": "Sin", "input": ["StatefulPartitionedCall/synth/lambda/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/lambda/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/synth/lambda/split", "StatefulPartitionedCall/synth/lambda/Cos"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/lambda/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/synth/lambda/split", "StatefulPartitionedCall/synth/lambda/Sin"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/lambda/Complex", "op": "Complex", "input": ["StatefulPartitionedCall/synth/lambda/mul_1", "StatefulPartitionedCall/synth/lambda/mul_2"], "attr": {"Tout": {"type": "DT_COMPLEX64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/synth/lambda/Complex", "StatefulPartitionedCall/synth/inverse_stft/transpose/perm"], "attr": {"T": {"type": "DT_COMPLEX64"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/irfft", "op": "IRFFT", "input": ["StatefulPartitionedCall/synth/inverse_stft/transpose", "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/irfft/fft_length"], "attr": {"Treal": {"type": "DT_FLOAT"}, "Tcomplex": {"type": "DT_COMPLEX64"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/mul", "op": "Mul", "input": ["StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/irfft", "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/inverse_stft_window_fn/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/Shape", "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice/stack", "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice/stack_1", "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/Shape", "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_1/stack", "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_1/stack_1", "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/Shape", "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_2/stack", "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_2/stack_1", "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_2/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/sub", "op": "Sub", "input": ["StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/strided_slice_2", "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/sub/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/floordiv", "op": "FloorDiv", "input": ["StatefulPartitionedCall/synth/inverse_stft/inverse_stft_tf.signal.istft/overlap_and_add/Neg", 